# -*- coding: utf-8 -*-

keyword_dict = {
    u'公安类': {
        u'其他': [
            [u'派出所'], [u'公安局'], [u'报警中心'], [u'警察'], [u'报警']
        ]
    },
    u'急救类': {
        u'其他': [
            [u'急救中心'], [u'急症中心']
        ]
    },
    u'贷款类': {
        u'其他':[
            [u'贷款'], [u'借贷'], [u'借钱'],
        ],
        u'车贷': [
            [u'车贷']
        ],
        u'催收': [
            [u'催收'],
            [u'讨债'],
            [u'讨钱'],
            [u'讨账'],
            [u'追债'],
            [u'追款'],
            [u'催债'],
            [u'催款'],
            [u'催账'],
            [u'催钱'],
            [u'要债'],
            [u'债主'],
            [u'债权'],
            [u'背债'],
            [u'收租'],
            [u'催租']
        ],
        u'抵押类':[
            [u'典当'],
            [u'当铺'],
            [u'抵押']
        ]
    },
    u'贷款中介类': {
        u'其他': [ 
            [u'假', u'征信'], [u'改', u'征信'], [u'洗', u'征信'], [u'消', u'征信'],
            [u'清', u'征信'], [u'屏蔽', u'征信'], [u'口子', u'贷'], [u'信贷员']
        ]
    },
    u'互联网金融类': {
        u'其他': [
            [u'拍拍贷'],
            [u'拍拍'],
            [u'捷信'],
            [u'闪银'],
            [u'宜人贷'],
            [u'宜信'],
            [u'佰仟'],
            [u'现金巴士'],
            [u'平安易贷'],
            [u'亲亲小贷'],
            [u'陆金所'],
            [u'花呗'],
            [u'微贷'],
            [u'稳安贷'],
            [u'你我贷'],
            [u'手机贷'],
            [u'人人贷'],
            [u'钱袋宝'],
            [u'我来贷'],
            [u'趣分期'],
            [u'分期乐'],
            [u'借呗'],
            [u'随心贷'],
            [u'有利网'],
            [u'爱投资'],
            [u'积木盒子'],
            [u'温州贷'],
            [u'鑫合汇']
        ]
    },
    u'银行类': {
        u'其他': [
            [u'银行'],
            [u'农村信用'],
            [u'信用社']
        ]
    },
    u'信用卡类': {
        u'银行客服': [
            [u'银行', u'信用卡'],
            [u'信用卡中心'],
            [u'信用卡', u'服务']
        ],
        u'黑户办卡': [
            [u'办卡'],
            [u'黑户']
        ],
        u'提额': [
            [u'提额', u'信用卡']
        ],
        u'套现': [
            [u'套现'], [u'pos']
        ]
    },
    u'法律类': {
        u'法院': [
            [u'法院']
        ],
        u'律师': [
            [u'律师']
        ],
        u'其他':[
            [u'律所'], [u'法律咨询'], [u'法官'], [u'司法']
        ]
    },
    u'不良习惯类': {
        u'赌博类': [
            [u'投注'],
            [u'彩票'],
            [u'赛马'],
            [u'乐透'],
            [u'赌球'],
            [u'赌球']
        ],
        u'假证类': [
            [u'假证'], [u'办证']
        ],
        u'其他': [
        	[u'烟'],[u'酒']
        ]
    },
    u'金融类': {
        u'投资理财': [
            [u'投资'],
            [u'投行'],
            [u'利息'],
            [u'理财'],
            [u'证券'],
            [u'信托'],
            [u'基金'],
            [u'炒股'],
            [u'股票'],
            [u'外汇'],
            [u'黄金'],
            [u'保险公司']
        ]
    },
    u'房产类': {
        u'房产中介': [
            [u'链家'],
            [u'我爱我家'],
            [u'房产', u'经纪人'],
            [u'房产中介']
        ],
        u'其他': [
            [u'买房'],
            [u'卖房'],
            [u'房产', u'公司'],
            [u'地产'],
            [u'楼盘'],
            [u'恒大'],
            [u'绿城'],
            [u'售楼处'],
            [u'物业'],
            [u'地产'],
            [u'房屋']
        ]
    },
    u'酒店类': {
        u'其他': [
            [u'酒店'],
            [u'宾馆'],
            [u'旅馆'],
            [u'旅店'],
            [u'旅社'],
            [u'山庄'],
            [u'住宿'],
            [u'驿站'],
            [u'客栈'],
            [u'招待所'],
            [u'度假村'],
            [u'度假公寓'],
            [u'锦江之星'],
            [u'速8'],
            [u'速八'],
            [u'7天'],
            [u'如家'],
            [u'格林豪泰'],
            [u'汉庭'],
            [u'宜必思'],
            [u'希尔顿'],
            [u'喜来登'],
        ]
    },
    u'旅游类': {
        u'出行': [
            [u'机票'],
            [u'航空'],
            [u'车站'],
            [u'火车'],
            [u'车票'],
            [u'机场'],
            [u'去哪儿'],
            [u'携程'],
            [u'去啊'],
            [u'同程'],
            [u'途牛'],
            [u'出租车'],
            [u'滴滴'],
            [u'的士'],
            [u'租车'],
            [u'专车'],
            [u'黑车'],
            [u'代驾'],
            [u'客车'],
            [u'客运'],
            [u'汽车']
        ],
        u'其他': [
            [u'导游'], [u'售票处'], [u'旅行']
        ]
    }, 
    u'娱乐类': {
        u'其他': [
            [u'娱乐'],
            [u'游戏'],
            [u'夜店'],
            [u'俱乐部'],
            [u'酒吧'],
            [u'ktv'],
            [u'KTV'],
            [u'ＫＴＶ'],
            [u'ｋｔｖ'],
            [u'娱 乐'],
            [u'夜 店'],
            [u'俱 乐 部'],
            [u'酒 吧'],
            [u'量贩式'],
            [u'影院'],
            [u'网吧'],
            [u'网咖'],
            [u'赛车'],
            [u'影城'],
            [u'台球'],
            [u'桌游'],
            [u'电玩'],
            [u'足疗'],
            [u'沐足'],
            [u'洗浴'],
            [u'会所'],
            [u'咖啡'],
            [u'茶馆'],
            [u'剧场'],
            [u'棋牌'],
            [u'按摩'],
            [u'温泉'],
            [u'夜总会'],
            [u'游乐园'],
            [u'密室'],
            [u'轰趴']
        ]
    },
    u'快递送餐类': {
        u'快递': [
            [u'物流'],
            [u'快递'],
            [u'快运'],
            [u'速递'],
            [u'速运'],
            [u'宅急送'],
            [u'圆通'],
            [u'申通'],
            [u'中通'],
            [u'汇通'],
            [u'国通'],
            [u'韵达'],
            [u'百世'],
            [u'优速'],
            [u'全峰'],            
            [u'顺丰'],
            [u'EMS'],
            [u'UPS'],
            [u'DHL'],
            [u'邮政']
        ],
        u'送餐': [
            [u'送餐'], [u'外卖'], [u'订餐'], [u'饿了么']
        ]
    },
    u'医疗类': {
        u'其他': [
            [u'医院'],
            [u'诊所'],
            [u'门诊'],
            [u'牙科'],
            [u'医生'],
            [u'医疗'],
            [u'美容'],
            [u'医药'],
            [u'病',u'看'],
            [u'感冒'],
            [u'生',u'病']
        ]
    },
    u'美妆类': {
    	u'其他': [
    		[u'口红'],[u'护肤'],[u'眼影'],[u'唇'],[u'眼线'],[u'眉'],[u'面膜'],[u'屈臣氏'],[u'精油'],[u'精华'],[u'乳液'],[u'霜'],[u'膏'],
    		[u'香奈'],[u'香水'],[u'黑管'],[u'黑瓶'],[u'红管'],[u'白管'],[u'TF'],[u'dior'],[u'louboutin'],[u'chanel'],[u'mac'],[u'兰蔻'],
    		[u'雅诗兰黛'],[u'ford'],[u'欧莱雅'],[u'ysl'],[u'纪梵希'],[u'娇兰'],[u'羊皮'],[u'圣罗兰'],[u'风吟'],[u'德国世家'],[u'cpb'],[u'隔离']
    	],
    },
    u'生驹里奈': {
    	u'其他':[
    		[u'驹']
    	]
    },
    u'推销类': {
        u'推销骚扰': [
            [u'广告'], [u'推销'], [u'骚扰'], [u'响一声']
        ],
        u'诈骗': [
            [u'诈骗']
        ]
    },
    u'美食类': {
        u'餐厅': [
            [u'火锅'], [u'咖啡厅'], [u'自助', u'餐'], [u'餐厅'], [u'料理'], [u'鸡排'], [u'汤粉'], [u'辣', u'虾'], 
            [u'烤鱼'], [u'菜馆'], [u'水饺'], [u'海鲜'], [u'家常菜'], [u'饺子']
        ],
        u'烧烤': [
            [u'烤肉'], [u'烧烤'] ,[u'烤', u'牛'], [u'烤', u'羊']
        ],
        u'面包甜点': [
            [u'面包'], [u'甜点'], [u'烘焙'], [u'奶', u'吧'], [u'冻', u'奶'] ,[u'果', u'茶'], [u'饮料']
        ],
        u'快餐':[
            [u'小吃'], [u'快餐'], [u'德克士'], [u'肯德基'], [u'麦当劳'], [u'凉面'], [u'必胜客'], [u'汉堡'], 
            [u'麻辣烫'], [u'披萨'], [u'豆浆']
        ],
        u'其他':[
        	[u'月饼'], [u'元祖'], [u'美心'], [u'蛋黄'], [u'莲蓉'], [u'豆沙'], [u'粉'], [u'吃']
        ]
    },
    u'生活类':{
        u'其他': [
            [u'摄影'], [u'婚纱'], [u'鲜花'], [u'复印'], [u'宠物'], [u'数码', u'相'], [u'照相馆'], [u'快印'],
            [u'数码', u'印'], [u'公证处'], [u'物业'], [u'干洗'], [u'彩票'], [u'殡仪'], [u'殡葬'], [u'电信'],
            [u'移动'], [u'联通'], [u'宽带'], [u'报刊'], [u'杂志'], [u'驾校']
        ]
    },
    u'运动类':{
        u'其他': [
            [u'健身房'], [u'游泳'], [u'瑜伽'], [u'篮球'], [u'乒乓球'], [u'羽毛球'], [u'体育', u'馆'],
            [u'舞蹈'], [u'网球'], [u'足球'], [u'高尔夫'], [u'保龄球'], [u'武术'], [u'体育', u'场'],
            [u'溜冰'], [u'滑雪']
        ]
    },
    u'购物类':{
        u'超市': [
            [u'超市'], [u'家乐福'], [u'便利店'], [u'商店']
        ],
        u'商场': [
            [u'商城'], [u'商场'], [u'购物中心'], [u'百货']
        ],
        u'其他': [
            [u'书店'], [u'花店'], [u'钟表眼镜'], [u'市场'], [u'批发'], [u'户外', u'店'], [u'买']
        ]
    },
    u'教育类':{
        u'其他':[
            [u'大学'], [u'学院'], [u'学校'], [u'教育'], [u'幼儿园'], [u'小学'], [u'中学'], [u'家教'],
            [u'老师'], [u'教授'], [u'留学']
        ]
    }
}
